{
  "typeIndex": 1052800,
  "name": "Server-side template injection",
  "description": "<p> Server-side template injection occurs when user input is unsafely embedded into a server-side template, allowing users to inject template directives. Using malicious template directives, an attacker may be able to execute arbitrary code and take full control of the web server. </p>\n<p>The severity of this issue varies depending on the type of template engine being used. Template engines range from being trivial to almost impossible to exploit. The following  steps should be used when attempting to develop an exploit: </p><ul>\n  <li>Identify the type of template engine being used.</li>\n  <li>Review its documentation for basic syntax, security considerations, and built-in methods and variables.</li>\n  <li>Explore the template environment and map the attack surface.</li>\n<li>Audit every exposed object and method.</li>\n</ul>\n<p>\nTemplate injection vulnerabilities can be very serious and can lead to complete compromise of the application's data and functionality, and often of the server that is hosting the application. It may also be possible to use the server as a platform for further attacks against other systems. On the other hand, some template injection vulnerabilities may pose no significant security risk.\n</p>",
  "remediation": "<p>Wherever possible, avoid creating templates from user input. Passing user input into templates as parameters is normally a safe alternative.</p>\n<p>If supporting user-submitted templates is a business requirement, consider using a simple logic-less template engine such as Mustache or one provided by the native language like Python's Template. If this is not an option, review the chosen template engine's documentation for hardening advice, and consider rendering the template within a sandboxed execution environment.</p>",
  "webIntro": null,
  "typicalSeverity": "HIGH",
  "references": [
    {
      "title": "Web Security Academy: Server-side template injection",
      "url": "https://portswigger.net/web-security/server-side-template-injection"
    },
    {
      "title": "Server-side template injection",
      "url": "https://portswigger.net/research/server-side-template-injection"
    },
    {
      "title": "FreeMarker hardening",
      "url": "http://freemarker.org/docs/app_faq.html#faq_template_uploading_security"
    },
    {
      "title": "Velocity Hardening",
      "url": "https://velocity.apache.org/engine/devel/apidocs/org/apache/velocity/util/introspection/SecureUberspector.html"
    },
    {
      "title": "Twig hardening",
      "url": "http://twig.sensiolabs.org/doc/api.html#sandbox-extension"
    }
  ],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-94: Improper Control of Generation of Code ('Code Injection')",
      "url": "https://cwe.mitre.org/data/definitions/94.html"
    },
    {
      "title": "CWE-95: Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')",
      "url": "https://cwe.mitre.org/data/definitions/95.html"
    },
    {
      "title": "CWE-116: Improper Encoding or Escaping of Output",
      "url": "https://cwe.mitre.org/data/definitions/116.html"
    }
  ]
}