{
  "typeIndex": 1049600,
  "name": "XML external entity injection",
  "description": "<p>XML external entity (XXE) injection vulnerabilities arise when applications process user-supplied XML documents without disabling references to external resources. XML parsers typically support external references by default, even though they are rarely required by applications during normal usage.</p>\n<p>External entities can reference files on the parser's filesystem; exploiting this feature may allow retrieval of arbitrary files, or denial of service by causing the server to read from a file such as /dev/random.</p>\n<p>External entities can often also reference network resources via the HTTP protocol handler. The ability to send requests to other systems can allow the vulnerable server to be used as an attack proxy.\n  By submitting suitable payloads, an attacker can cause the application server to attack other systems that it can interact with. \n  This may include public third-party systems, internal systems within the same organization, or services available on the local loopback adapter of the application server itself. \n  Depending on the network architecture, this may expose highly vulnerable internal services that are not otherwise accessible to external attackers.\n</p>",
  "remediation": "<p>Parsers that are used to process XML from untrusted sources should be configured to disable processing of all external resources. This is usually possible, and will prevent a number of related attacks.&nbsp;You should consult the documentation for your XML parsing library to determine how to achieve this.</p>\n\n<p>XML external entity injection makes use of the DOCTYPE tag to define the injected entity. It may also be possible to disable the DOCTYPE tag or use input validation to block input containing it.</p>",
  "webIntro": null,
  "typicalSeverity": "HIGH",
  "references": [
    {
      "title": "Web Security Academy: XXE injection",
      "url": "https://portswigger.net/web-security/xxe"
    }
  ],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-611: Improper Restriction of XML External Entity Reference ('XXE')",
      "url": "https://cwe.mitre.org/data/definitions/611.html"
    },
    {
      "title": "CAPEC-228: DTD Injection",
      "url": "https://capec.mitre.org/data/definitions/228.html"
    }
  ]
}