{
  "typeIndex": 2097536,
  "name": "Web cache poisoning",
  "description": "<p>Web caches identify resources using a few specific components of each HTTP request, together known as the cache key. Two requests with the same cache key are regarded by the cache as equivalent. </p>\n<p>\nWeb cache poisoning vulnerabilities arise when an application behind a cache processes input that is not included in the cache key. Attackers can exploit this by sending crafted input to trigger a harmful response that the cache will then save and serve to other users.\n</p>\n<p>\nThe impact is potentially serious as the malicious cached page may be served to a large number of users without other interaction. The threat posed by this vulnerability depends largely on what can be achieved with the input. Often the input is vulnerable to XSS, or can be used to trigger a redirect to another domain. Other times, it can simply be used to swap pages around.\n</p>",
  "remediation": "<p>To resolve this issue, either disable support for the affected input, or disable caching on all affected pages.</p>\n<p>If both the affected input and caching behavior are required, configure the cache to ensure that the input is included in the cache key. Depending on which caching solution you use, if the input is in a request header it might be possible to achieve this using the Vary response header.</p>",
  "webIntro": null,
  "typicalSeverity": "HIGH",
  "references": [
    {
      "title": "Web Security Academy: Web cache poisoning",
      "url": "https://portswigger.net/web-security/web-cache-poisoning"
    },
    {
      "title": "PortSwigger Research: Practical Web Cache Poisoning",
      "url": "https://portswigger.net/research/web-cache-poisoning"
    },
    {
      "title": "PortSwigger Research: Web Cache Entanglement",
      "url": "https://portswigger.net/research/web-cache-entanglement-novel-pathways-to-poisoning"
    },
    {
      "title": "HTTP Vary header",
      "url": "https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Vary"
    }
  ],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-436: Interpretation Conflict",
      "url": "https://cwe.mitre.org/data/definitions/436.html"
    },
    {
      "title": "CAPEC-141: Cache Poisoning",
      "url": "https://capec.mitre.org/data/definitions/141.html"
    }
  ]
}