{
  "typeIndex": 2097664,
  "name": "HTTP response header injection",
  "description": "<p>HTTP response header injection vulnerabilities arise when user-supplied data is copied into a response header in an unsafe way. If an attacker can inject newline characters into the header, then they can inject new HTTP headers and also, by injecting an empty line, break out of the headers into the message body and write arbitrary content into the application's response.</p>\n<p>Various kinds of attack can be delivered via HTTP response header injection vulnerabilities. Any attack that can be delivered via cross-site scripting can usually be delivered via response header injection, because the attacker can construct a request that causes arbitrary JavaScript to appear within the response body. Further, it is sometimes possible to leverage response header injection vulnerabilities to poison the cache of any proxy server via which users access the application. Here, an attacker sends a crafted request that results in a \"split\" response containing arbitrary content. If the proxy server can be manipulated to associate the injected response with another URL used within the application, then the attacker can perform a \"stored\" attack against this URL, which will compromise other users who request that URL in future.\n</p>",
  "remediation": "<p>If possible, applications should avoid copying user-controllable data into HTTP response headers. If this is unavoidable, then the data should be strictly validated to prevent response header injection attacks. In most situations, it will be appropriate to allow only short alphanumeric strings to be copied into headers, and any other input should be rejected. At a minimum, input containing any characters with ASCII codes less than 0x20 should be rejected.</p>",
  "webIntro": null,
  "typicalSeverity": "HIGH",
  "references": [],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-113: Improper Neutralization of CRLF Sequences in HTTP Headers ('HTTP Response Splitting')",
      "url": "https://cwe.mitre.org/data/definitions/113.html"
    },
    {
      "title": "CAPEC-34: HTTP Response Splitting",
      "url": "https://capec.mitre.org/data/definitions/34.html"
    }
  ]
}