{
  "typeIndex": 3145984,
  "name": "Cleartext submission of password",
  "description": "<p>Some applications transmit passwords over unencrypted connections, making them vulnerable to interception. To exploit this vulnerability, an attacker must be suitably positioned to eavesdrop on the victim's network traffic. This scenario typically occurs when a client communicates with the server over an insecure connection such as public Wi-Fi, or a corporate or home network that is shared with a compromised computer. Common defenses such as switched networks are not sufficient to prevent this. An attacker situated in the user's ISP or the application's hosting infrastructure could also perform this attack. Note that an advanced adversary could potentially target any connection made over the Internet's core infrastructure.</p>\n<p>Vulnerabilities that result in the disclosure of users' passwords can result in compromises that are extremely difficult to investigate due to obscured audit trails. Even if the application itself only handles non-sensitive information, exposing passwords puts users who have re-used their password elsewhere at risk.</p>",
  "remediation": "<p>Applications should use transport-level encryption (SSL or TLS) to protect all sensitive communications passing between the client and the server. Communications that should be protected include the login mechanism and related functionality, and any functions where sensitive data can be accessed or privileged actions can be performed. These areas should employ their own session handling mechanism, and the session tokens used should never be transmitted over unencrypted communications. If HTTP cookies are used for transmitting session tokens, then the secure flag should be set to prevent transmission over clear-text HTTP.</p>",
  "webIntro": null,
  "typicalSeverity": "HIGH",
  "references": [],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-319: Cleartext Transmission of Sensitive Information",
      "url": "https://cwe.mitre.org/data/definitions/319.html"
    },
    {
      "title": "CAPEC-117: Interception",
      "url": "https://capec.mitre.org/data/definitions/117.html"
    }
  ]
}