{
  "typeIndex": 5246979,
  "name": "Link manipulation (reflected)",
  "description": "<p>Link manipulation occurs when an application embeds user input into the path or domain of URLs that appear within application responses.&nbsp;An attacker can use this vulnerability to construct a link that, if visited by another application user, will modify the target of URLs within the response. It may be possible to leverage this to perform various attacks, such as:</p>\n<ul>\n  <li>Manipulating the path of an on-site link that has sensitive parameters in the URL. If the response from the modified path contains references to off-site resources, then the sensitive data might be leaked to external domains via the Referer header.</li>\n  <li>Manipulating the URL targeted by a form action, making the form submission have unintended side effects.</li>\n  <li>Manipulating the URL used by a CSS import statement to point to an attacker-uploaded file, resulting in CSS injection.</li>\n  <li>Injecting on-site links containing XSS exploits, thereby bypassing browser anti-XSS defenses, since those defenses typically do not operate on on-site links.</li>\n</ul>\n<p>The security impact of this issue depends largely on the nature of the application functionality. Even if it has no direct impact on its own, an attacker may use it in conjunction with other vulnerabilities to escalate their overall severity.</p>",
  "remediation": "<p>Consider using a whitelist to restrict user input to safe values. Please note that in some situations this issue will have no security impact, meaning no remediation is necessary.</p>",
  "webIntro": null,
  "typicalSeverity": "INFO",
  "references": [
    {
      "title": "Using path manipulation to hijack Flickr accounts",
      "url": "https://mishresec.wordpress.com/2017/10/13/yahoo-bug-bounty-chaining-3-minor-issues-to-takeover-flickr-accounts/"
    }
  ],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-73: External Control of File Name or Path",
      "url": "https://cwe.mitre.org/data/definitions/73.html"
    },
    {
      "title": "CWE-20: Improper Input Validation",
      "url": "https://cwe.mitre.org/data/definitions/20.html"
    },
    {
      "title": "CAPEC-153: Input Data Manipulation",
      "url": "https://capec.mitre.org/data/definitions/153.html"
    }
  ]
}