{
  "typeIndex": 6291712,
  "name": "Directory listing",
  "description": "<p>Web servers can be configured to automatically list the contents of directories that do not have an index page present. This can aid an attacker by enabling them to quickly identify the resources at a given path, and proceed directly to analyzing and attacking those resources. It particularly increases the exposure of sensitive files within the directory that are not intended to be accessible to users, such as temporary files and crash dumps.</p>\n<p>Directory listings themselves do not necessarily constitute a security vulnerability. Any sensitive resources within the web root should in any case be properly access-controlled, and should not be accessible by an unauthorized party who happens to know or guess the URL. Even when directory listings are disabled, an attacker may guess the location of sensitive files using automated tools.</p>",
  "remediation": "<p>There is not usually any good reason to provide directory listings, and disabling them may place additional hurdles in the path of an attacker. This can normally be achieved in two ways:</p>\n<ul>\n<li>Configure your web server to prevent directory listings for all paths beneath the web root; </li>\n<li>Place into each directory a default file (such as index.htm) that the web server will display instead of returning a directory listing.</li></ul>",
  "webIntro": null,
  "typicalSeverity": "INFO",
  "references": [
    {
      "title": "Web Security Academy: Information disclosure via directory listings",
      "url": "https://portswigger.net/web-security/information-disclosure/exploiting#directory-listings"
    }
  ],
  "vulnerabilityClassifications": [
    {
      "title": "CWE-538: File and Directory Information Exposure",
      "url": "https://cwe.mitre.org/data/definitions/538.html"
    },
    {
      "title": "CWE-548: Information Exposure Through Directory Listing",
      "url": "https://cwe.mitre.org/data/definitions/548.html"
    },
    {
      "title": "CAPEC-37: Retrieve Embedded Sensitive Data",
      "url": "https://capec.mitre.org/data/definitions/37.html"
    }
  ]
}